“虚拟文件系统(Vitrual Filesystem)”是一个内核软件层,它其实是一个中间层，上层操作可以直接操作该中间层对下层实际文件系统进行操作。对所有的读写操作内核都会将其替换成支持本地的Linux文件系统或者其他文件系统。
“虚拟文件系统”支持的文件系统可以划分为三种主要类型：
	1.磁盘文件系统
	2.网络文件系统
	3.特殊文件系统
VFS主要引入了一种通用的文件模型，这个模型能够表示所有支持的文件系统。在通用文件系统中，每个目录被看做一个文件，可以包含若干文件和其他子目录。对于有些非Unix的基于磁盘的文件系统，他们利用文件分区表(File Allocation Table,FAT)存放每个文件在目录树中的位置,在这些文件系统中，存放文件的是目录不是文件。
通用文件模型由下列对象类型组成：
	1.超级块对象(Superblock)
	   存放已存在的文件系统信息，在基于磁盘的文件系统中，该类对象对应磁盘中的文件系统控制块。
	2.索引节点对象(Inode)
	   存储关于文件的常用信息。在基于磁盘的文件系统中，该类对象对应磁盘上的文件控制卡。每个索引节点           对象都有唯一的节点号用来表示文件系统中的文件。
	3.文件对象
	   存储打开文件于进程交互的有关信息。这类信息在进程访问文件时保存在内核内存中
	4.目录项对象
	   存储目录项(文件特定的名称)，与对应文件进行链接的有关信息。每个磁盘文件系统都有特有的方式存储		  信息。
